app/Controllers/Login.php

SELECT *
FROM `tbl_login`
WHERE `nama_pengguna` = 'superadmin'
AND `kata_sandi` = '123'
---
    public function auth()
    {
        //Validasi Isian Form
        if ($this->validate([
            'nama_pengguna' => [
                'label' => 'Nama Pengguna',
                'rules' => 'required',
                'errors'    => [
                    'required'  => '{field} Wajib Diisi'
                ]
            ],
            'kata_sandi' => [
                'label' => 'Kata Sandi',
                'rules' => 'required',
                'errors'    => [
                    'required'  => '{field} Wajib Diisi'
                ]
            ],
        ])) {
            //Jika Validasi Isian Form Berhasil
            $nama_pengguna = $this->request->getPost('nama_pengguna');
            $kata_sandi = $this->request->getPost('kata_sandi');
            $cek = $this->LoginModel->where([
				'nama_pengguna'  => $nama_pengguna,
				'kata_sandi'  => $kata_sandi
			])
			->get()
			->getRowArray();