app/Controllers/Superadmin.php

    public function Pembayaran()
    {
        $data = [
            'title' => 'Master Data',
            'subtitle' => 'Pembayaran',
            'AmbilSemuaDataPembayaran' => $this->PembayaranModel->findAll(),
        ];
---
SELECT *
FROM `tbl_pembayaran`
WHERE `tbl_pembayaran`.`deleted_at` IS NULL

    public function TambahDataPembayaran()
    {
        $data = [
            'nama_pembayaran' => reduce_multiples(ucwords(strtolower($this->request->getPost('nama_pembayaran'))), ' ', true),
        ];
        $this->PembayaranModel->insert($data);
---
INSERT INTO `tbl_pembayaran` (`nama_pembayaran`, `created_at`, `updated_at`) VALUES ('Kesejahteraan', '2022-06-23 14:58:14', '2022-06-23 14:58:14')

    public function HapusDataPembayaran($id_pembayaran)
    {
        $data = [
            'id_pembayaran' => $id_pembayaran,
        ];
        $this->PembayaranModel->delete($data);
---
UPDATE `tbl_pembayaran` SET `deleted_at` = '2022-06-23 14:58:20', `updated_at` = '2022-06-23 14:58:20'
WHERE `id_pembayaran` IN ('1')
AND `deleted_at` IS NULL

    public function Guru()
    {
        $data = [
            'title' => 'Master Data',
            'subtitle' => 'Guru',
            'AmbilSemuaDataGuru' => $this->GuruModel->findAll(),
---
SELECT *
FROM `tbl_guru`
WHERE `tbl_guru`.`deleted_at` IS NULL

    public function TambahDataGuru()
    {
        if ($this->validate(
            [
                'nama_lengkap_guru'    => [
                    'label' => 'Nama Lengkap',
                    'rules'  => 'required|min_length[3]',
                    'errors' => [
                        'required' => '{field} Wajib diisi',
                        'min_length' => '{field} Minimal 3 karakter',
                    ]
                ],
            ]
        )) {
            $data = [
                'rfid' => $this->request->getPost('rfid'),
                'nama_lengkap_guru' => reduce_multiples(ucwords(strtolower($this->request->getPost('nama_lengkap_guru'))), ' ', true),
                'nip_guru' => $this->request->getPost('nip_guru'),
                'nuptk_guru' => $this->request->getPost('nuptk_guru'),
                'id_kelas' => $this->request->getPost('id_kelas'),
                'id_matapelajaran' => $this->request->getPost('id_matapelajaran'),
                'jenis_kelamin_guru' => $this->request->getPost('jenis_kelamin_guru'),
            ];
            $this->GuruModel->insert($data);
---
INSERT INTO `tbl_guru` (`rfid`, `nama_lengkap_guru`, `nip_guru`, `nuptk_guru`, `created_at`, `updated_at`) VALUES ('', 'Muh. Ramadhan', '', NULL, '2022-06-25 13:37:44', '2022-06-25 13:37:44')